def area(a, b):
    '''
    Принимает стороны прямоугольника a и b
    и возвращает его площадь.
    
            Параметры:
                    a (int) : первая сторона прямоугольника
                    b (int) : вторая сторона прямоугольника
            
            Возвращаемое значение:
                    area (a, b) : площадь прямоугольника со сторонами a и b
    
    '''
    return a * b 

def perimeter(a, b):
    '''
    Принимает стороны прямоугольника a и b
    и возвращает его периметр.
    
            Параметры:
                    a (int) : первая сторона прямоугольника
                    b (int) : вторая сторона прямоугольника
            
            Возвращаемое значение:
                    perimeter (a, b) : периметр прямоугольника со сторонами a и b
    
    '''
    return 2 * (a + b)
