def area(a, b):
    '''
    Возвращает значение площади прямоугольника

        Параметры:
            a (int/float): величина стороны прямоугольника (первая сторона) \n
            b (int/float): величина стороны прямоугольника (смежная первой стороне)

        Возвращаемое значение:
            a * b (int/float): величина площади прямоугольника
    '''
    return a * b


def perimeter(a, b):
    '''
        Возвращает значение периметра прямоугольника

            Параметры:
                a (int/float): величина стороны прямоугольника (первая сторона) \n
                b (int/float): величина стороны прямоугольника (смежная первой стороне)

            Возвращаемое значение:
                (a + b) * 2 (int/float): величина периметра прямоугольника
    '''
    return (a + b) * 2
