def area(a, b):
    '''
    Вычисляет площадь прямоугольника.

    Параметры:
        a (float) - первая сторона прямоугольника
        b (float) - вторая сторона прямоугольника
    Возвращаемое значение:
        float - площадь прямоугольника
    '''
    return a * b 

def perimeter(a, b):
    '''
    Вычисляет периметр прямоугольника.

    Параметры:
        a (float) - первая сторона прямоугольника
        b (float) - вторая сторона прямоугольника
    Возвращаемое значение:
        float - периметр прямоугольника
    '''
    return (a + b) * 2