def area(a, b):
    '''
    Функция принимает на вход стороны прямоугольника и возвращает его площадь
        Входные данные:
            a (int) -- длина первой стороны
            b (int) -- длина второй (смежной) стороны
        Выходные данные:
            a * b (int) -- площадь прямогульника
    '''
    return a * b 

def perimeter(a, b):
    '''
    Функция принимает на вход стороны прямоугольника и возвращает его периметр
        Входные данные:
            a (int) -- длина первой стороны
            b (int) -- длина второй (смежной) стороны
        Выходные данные:
            a * b (int) -- периметр прямогульника
    '''
    return (a + b) * 2
