def area(a, b): 
    '''
    Возвращает площадь прямоугольника длины a и ширины b

        Параметры:
            a (int/float): длина прямоугольника
            b (int/float): ширина прямоугольника

        Возвращаемое значение (int/float):
            Площадь прямоугольника по математической формуле            
    '''
    return a * b 

def perimeter(a, b): 
    '''
    Возвращает периметр прямоугольника длина a и ширины b

        Параметры:
            a (int/float): длина прямоугольника
            b (int/float): ширина прямоугольника

        Возвращаемое значение (int/float):
            периметр прямоугольника по математической формуле
    '''
    return 2 * ( a + b )

