def area(a, b):
    '''
    Возвращает площадь прямоугольника по заданным сторонам
        Входные данные:
            a (int) - длина одной из сторон
            b (int) - длина другой стороны

        Возвращаемое значение:
            a * b (int) - площадь прямоугольника
    '''
    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника по заданным сторонам
        Входные данные:
            a (int) - длина одной из сторон
            b (int) - длина другой стороны

        Возвращаемое значение:
            2 * (a + b) (int) - периметр прямоугольника
    '''
    return 2 * (a + b)
