def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника по двум его сторонам
    
        Параметры:
            a (float): длина прямоугольника
            b (float): ширина прямоугольника
            
        Возвращаемое значение:
            2 * (a + b) (float): периметр прямоугольника со сторонами a и b
    '''
    return 2 * (a + b)

def area(a, b):
    '''
    Возвращает площадь прямоугольника по двум его сторонам
    
        Параметры:
            a (float): длина прямоугольника
            b (float): ширина прямоугольника
            
        Возвращаемое значение:
            a * b (float): площадь прямоугольника со сторонами a и b
    '''
    return a * b
