def area(a, b):
    '''
    Возвращает площадь прямоугольника со сторонами a, b

        Параметры:
            a (float): первая сторона прямоугольника
            b (float): вторая сторона прямоугольника

        Возвращаемое значение:
            a * b  (float): площадь прямоугольника
    '''
    return a * b


def perimeter(a, b):
    '''
    Возвращает площадь периметр со сторонами a, b

        Параметры:
            a (float): первая сторона прямоугольника
            b (float): вторая сторона прямоугольника

        Возвращаемое значение:
            2 * (a * b)  (float): периметр прямоугольника
    '''
    return 2 * (a + b)
