def area(a, b):
    '''
        Возвращает площадь прямоугольника с задаными сторонами

            Параметры:
                a (float): первая сторона прямоугольника
                b (float): вторая сторона прямоугольника
            Возвращаемое значение:
                S (float): площадь прямоугольника
    '''
    return a * b 

def perimeter(a, b):
    '''
        Возвращает периметр прямоугольника с задаными сторонами

            Параметры:
                a (float): первая сторона прямоугольника
                b (float): вторая сторона прямоугольника
            Возвращаемое значение:
                P (float): периметр прямоугольника
    '''
    return 2 * a + 2 * b