
def area(a):
    '''
        Возвращает площадь квадрата с заданой стороной

            Параметры:
                a (float): сторона квадрата
            Возвращаемое значение:
                S (float): площадь квадрата
    '''
    return a * a


def perimeter(a):
    '''
        Возвращает периметр квадрата с заданой стороной

            Параметры:
                a (float): сторона квадрата
            Возвращаемое значение:
                P (float): периметр квадрата
    '''
    return 4 * a