
def area(a):
    '''
    Возвращает площадь квадрата по его стороне
    
        Параметры:
            a (float): сторона квадрата 
            
        Возвращаемое значение:
            a * a (float): площадь квадрата со стороной a
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата по его стороне
    
        Параметры:
            a (float): сторона квадрата 
            
        Возвращаемое значение:
            4 * a (float): периметр квадрата со стороной a
    '''
    return 4 * a
