
def area(a):
    '''
    Возвращает площадь квадрата с длиной стороны a

        Параметры:
            a (int/float): длина стороны квадрата

        Возвращаемое значение (int/float):
                площадь квадрата по математической формуле
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата с длиной стороны a

        Параметры:
             a (int/float): длина стороны квадрата

        Возвращаемое значение (int, float):
            периметр квадрата по математической формуле
    '''
    return 4 * a
