def area(a):
    '''
    Возвращает значение площадиaq квадрата

        Параметры:
            a (int/float): величина стороны квадрата

        Возвращаемое значение:
            a * a (int/float): величина площади квадрата
    '''
    return a * a


def perimeter(a):
    '''
        Возвращает значение периметра квадрата

            Параметры:
                a (int/float): величина стороны квадрата

            Возвращаемое значение:
                4 * a (int/float): величина периметра квадрата
    '''
    return 4 * a
