
def area(a):
    '''
    Принимает сторону квадрата и возвращает
    его площадь.
    
            Параметры:
                    a (int) : сторона квадрата
            
            Возвращаемое значение:
                    area (a) : площадь квадрата со стороной a
    
    '''
    return a * a


def perimeter(a):
    '''
    Принимает сторону квадрата и возвращает
    его периметр.
    
            Параметры:
                    a (int) : сторона квадрата
            
            Возвращаемое значение:
                    perimeter (a) : периметр квадрата со стороной a
    
    '''
    return 4 * a
