
def area(a):
    '''
        Функция принимает на вход сторону квадрата и возвращает его площадь
            Входные данные:
                a (int) -- длина стороны
            Выходные данные:
                a * a (int) -- площадь квадрата
    '''

    return a * a


def perimeter(a):
    '''
        Функция принимает на вход сторону квадрата и возвращает его периметр
            Входные данные:
                a (int) -- длина стороны
            Выходные данные:
                4 * a (int) -- периметр квадрата
    '''

    return 4 * a
