
def area(a, h): 
    '''
    Возвращает площадь прямоугольника с основанием a и высотой h

        Параметры:
            a (int/float): основание треугольника
            b (int/float): высота треугольника

        Возвращаемое значение (int/float):
            площадь прямоугольника с основанием a и высотой h
    '''
    return a * h / 2 

def perimeter(a, b, c): 
    '''
    Возвращает периметр треугольника (сумму длин сторон)

        Параметры:
            a (int/float): первая сторона треугольника
            b (int/float): вторая сторона треугольника
            с (int/float): третья сторона треугольника

        Вовзвращаемое значение:
            периметр (сумма длин сторон) треугольника
    '''
    return a + b + c 

