def area(a, h):
    '''
        Функция принимает на вход основание и высоту треугольника и возвращает его площадь
            Входные данные:
                a (int) -- длина основания треугольника
                h (int) -- высота треугольника
            Выходные данные:
                a * h / 2 (int) -- площадь треугольника
    '''

    return a * h / 2 

def perimeter(a, b, c):
    '''
        Функция принимает на вход 3 стороны треугольника и возвращает его периметр
            Входные данные:
                a (int) -- 1 сторона треугольника
                b (int) -- 2 сторона треугольника
                c (int) -- 3 сторона треугольника
            Выходные данные:
                a + b + c (int) -- периметр треуголь
    '''
    return a + b + c
